app/Controllers/Home.php

SELECT *
FROM `profiles`
SELECT *
FROM `profile_handlers`
---
    public function index()
    {
        $profiledata = $this->profileModel->asArray()->findAll();

        $profilehandlers = $this->profileHandlerModel->asArray()->findAll();

INSERT INTO `profiles` (`PROFILE_NAME`, `PROFILE_ADMIN`, `PROFILE_HANDLER`, `INSTITUTION`) VALUES ('Lydia', 'Mbarire', 'Lewis', 'Oakland')
---
    public function saveprofile()
    {
        // Load the ProfileModel
        $profileModel = new ProfileModel();


        // Validate form data (optional, add rules as per your requirements)
        $validation = \Config\Services::validation();

        // Get the form data
        $data = [
            'PROFILE_NAME'     => $this->request->getPost('profile_name'),
            'PROFILE_ADMIN'    => $this->request->getPost('profile_owner'),
            'PROFILE_HANDLER'  => $this->request->getPost('writer'),
            'INSTITUTION'      => $this->request->getPost('institution'),
            // Add any other fields you need to save
        ];

        $validation->setRules([
            'PROFILE_NAME'    => 'required',
            'PROFILE_ADMIN'   => 'required',
            'PROFILE_HANDLER' => 'required',
            'INSTITUTION'     => 'required',
        ]);

        if ($validation->run($data)) {
            // Save the data to the database
            $profileModel->save($data);