app/Controllers/Settings.php

SELECT *
FROM `admin`
WHERE `admin`.`ADMIN_ID` = '1'
---
    public function index()
    {
        // Retrieve the admin's data from session or database
        $adminId = $this->session->get('ADMIN_ID');
        $admin = $this->adminModel->find($adminId);

SELECT *
FROM `admin`
WHERE `admin`.`ADMIN_ID` = '1'
---
    public function updatePassword()
    {
        $adminId = $this->session->get('ADMIN_ID');

        // Validate form inputs
        $validation = \Config\Services::validation();
        $validation->setRules([
            'current_password' => 'required',
            'new_password' => 'required|min_length[6]',
            'confirm_password' => 'required|matches[new_password]',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            // Validation failed, redirect back with errors
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        // Check current password
        $admin = $this->adminModel->find($adminId);

UPDATE `admin` SET `PASS_HASH` = '$2y$10$/O/NtLjO9yc4A1bmBxfEqulkCw1rwPUCTtu/I3oV35cb89416Hpku'
WHERE `admin`.`ADMIN_ID` IN ('1')
---
        $hash = password_hash($newPassword, PASSWORD_BCRYPT);

        // Update password in the database
        $this->adminModel->update($adminId, ['PASS_HASH' => $hash]);