app/Models/AdminModel.php

SELECT *
FROM `admin`
WHERE `ADMIN_NAME` = 'superadmin'
 LIMIT 1
---
    public function getAdminByUsername($username)
    {
        return $this->where('ADMIN_NAME', $username)->first();